In [19]:
import pandas as pd
import numpy as np
import seaborn as sns
countris = ['India', 'France', 'England']
capitals = ['Delhi', 'Paris', 'London']
arr = np.array(capitals)
pd_arrr = pd.Series(data=capitals, index=countris)
print('panda arr using py list: ',pd_arrr)
print('panda arr using np list: ',arr)
print('using index:', pd_arrr[['France', 'India']])

panda arr using py list:  India       Delhi
France      Paris
England    London
dtype: object
panda arr using np list:  ['Delhi' 'Paris' 'London']
using index: France    Paris
India     Delhi
dtype: object

In [30]:
dictnary = {'a':10, 'b':20, 'c':30, 'd':40, 'e':50, 'f':60, 'g':70, 'h':80}
num_dictnarynum = {1:10, 2:20, 3:30}
num_dictnary = pd.Series(data=num_dictnarynum)
print('print index: ', num_dictnary.index)

print index:  Int64Index([1, 2, 3], dtype='int64')

In [32]:
num_series = pd.Series(data=[21,12,13,24])
print('print series: ', num_series)
print('print index: ', num_series.index)

print series:  0    21
1    12
2    13
3    24
dtype: int64
print index:  RangeIndex(start=0, stop=4, step=1)

In [37]:
#Data frame starts from here
fruit = ['Apple', 'Banana', 'Coconut', 'Dates']
fruit_df = pd.DataFrame(data=fruit, columns=['Fruit'])
print('print dataframe:\n ', fruit_df)

print dataframe:
       Fruit
0    Apple
1   Banana
2  Coconut
3    Dates

In [38]:
#Dataframe from nested lists
people = [['Rick', 60, 'O+'], ['Morty', 10, 'O+'], ['Summer', 45, 'A-'], ['Beth', 18, 'B+']]
people_df = pd.DataFrame(data=people, columns=['Name', 'Age', 'Blood grp'])
people_df

     Name  Age Blood grp
0    Rick   60        O+
1   Morty   10        O+
2  Summer   45        A-
3    Beth   18        B+

In [39]:
#dataframe from dictionary
people_dict = {'Name': ['Rick', 'Morty', 'Summer', 'Beth'],
              'Age': [60, 10, 45, 18],
              'Blood grp':['O+', 'O+', 'A-', 'B+']}
peopledict_df = pd.DataFrame(data=people_dict)
peopledict_df

     Name  Age Blood grp
0    Rick   60        O+
1   Morty   10        O+
2  Summer   45        A-
3    Beth   18        B+

In [41]:
#loading csv into dataframe
csv_df = pd.read_csv(filepath_or_buffer='https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.csv')
csv_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20